ivadasz/DragonFlyBSD/share/man/man4/aperf.4
.\"
.\" Copyright (c) 2015 The DragonFly Project.  All rights reserved.
.\" 
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in
.\"    the documentation and/or other materials provided with the
.\"    distribution.
.\" 3. Neither the name of The DragonFly Project nor the names of its
.\"    contributors may be used to endorse or promote products derived
.\"    from this software without specific, prior written permission.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
.\" FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
.\" COPYRIGHT HOLDERS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES (INCLUDING,
.\" BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
.\" LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
.\" AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
.\" OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
.\" OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd February 14, 2015
.Dt APERF 4
.Os
.Sh NAME
.Nm aperf
.Nd driver measuring effective CPU frequency via APERF/MPERF MSRs
.Sh SYNOPSIS
To compile this driver into the kernel,
place the following lines in your kernel configuration file:
.Bd -ragged -offset indent
.Cd "device aperf"
.Ed
.Pp
Alternatively, to load the driver as a
module at boot time, place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
aperf_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
driver provides support for measuring the effective CPU frequency, using the
APERF and MPERF MSRs.
The values are exposed through the
.Dv HW_SENSORS
.Xr sysctl 3
tree.
For example:
.Bd -literal -offset indent
%sysctl hw.sensors
hw.sensors.aperf.raw0: 2593 (Eff-Freq CPU0 (MHz))
hw.sensors.aperf.raw1: 2593 (Eff-Freq CPU1 (MHz))
hw.sensors.aperf.raw2: 2591 (Eff-Freq CPU2 (MHz))
hw.sensors.aperf.raw3: 2586 (Eff-Freq CPU3 (MHz))
.Ed
.Sh HARDWARE
The
.Nm
driver supports all AMD and Intel CPUs which provide the APERF and MPERF MSRs:
.Pp
.Bl -bullet -compact
.It
Most AMD CPUs starting at Family 10h
.It
Most Intel CPUs starting from Core series and Atom respectively.
.El
.Sh SEE ALSO
.Xr systat 1 ,
.Xr sysctl 3 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Dx 4.1 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Imre Vadasz Aq Mt imre@vdsz.com .
