ivadasz/DragonFlyBSD/share/man/man4/i915kms.4
.\" Copyright (c) 2015 Imre Vadász
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 30, 2015
.Dt I915KMS 4
.Os
.Sh NAME
.Nm i915kms
.Nd Driver for Intel i915 family integrated graphics chipsets
.Sh DESCRIPTION
The
.Nm
driver provides support for the integrated graphics chips by Intel.
.Sh HARDWARE
It supports all chipset generations from I915 up to the
integrated GPU of the Broadwell CPU family.
.Sh SYSCTL VARIABLES
If display backlight level can be controlled by the GPU (which is mostly
the case in notebooks), the sysctl
.Va hw.backlight_level
can be used to adjust the backlight level.
Permitted values are from 0 to the value of
.Va hw.backlight_max .
.Sh SEE ALSO
.Xr drm 4 ,
.Xr syscons 4
.Sh HISTORY
I915KMS was first available for Linux.
.Sh BUGS
Currently MSI interrupts cannot be used by
.Nm
because MSI support
is still missing from the vgapci driver.
XXX find more
