ivadasz/DragonFlyBSD/share/man/man4/radeonkms.4
.\" Copyright (c) 2015 Imre Vadász
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd May 30, 2015
.Dt RADEONKMS 4
.Os
.Sh NAME
.Nm radeonkms
.Nd Driver for AMD/ATI Radeon graphics chipsets
.Sh DESCRIPTION
The
.Nm
driver provides support for the radeon graphics chips by AMD/ATI.
Currently supported chipsets include almost all GPU chipsets up to the
Sea Islands generation.
.Sh LOADER TUNABLES
Tunables can be set at the
.Xr loader 8
prompt before booting the kernel or stored in
.Xr loader.conf 5 .
.Bl -tag -width "xxxxxx"
.It Va drm.radeon.no_wb
Disables AGP writeback for scratch registers.
.It Va drm.radeon.dynclks
Enable/Disable dynamic clocks
.It Va drm.radeon.r4xx_atom
XXX
.It Va drm.radeon.vram_limit
XXX
.It Va drm.radeon.agpmode
XXX
.It Va drm.radeon.gart_size
XXX
.It Va drm.radeon.benchmarking
XXX
.It Va drm.radeon.testing
XXX
.It Va drm.radeon.connector_table
XXX
.It Va drm.radeon.tv
XXX
.It Va drm.radeon.audio
XXX
.It Va drm.radeon.disp_priority
XXX
.It Va drm.radeon.hw_i2c
XXX
.It Va drm.radeon.pcie_gen2
XXX
.It Va drm.radeon.msi
MSI interrupts are not supported yet for RADEONKMS.
Trying to enable MSI forcibly may prevent the driver from working
(since MSI support is currently unavailable in the vgapci driver).
XXX explain possible values 1, 0, -1
.It Va drm.radeon.lockup_timeout
XXX
.It Va drm.radeon.fastfb
Direct FB access for IGP chips, which can significantly improve performance
for some applications.
This option currently only affects the RS690, RS780 and RS880 chipsets.
(1 = enable, 0 = disable (default))
.It Va drm.radeon.dpm
DPM (dynamic power management) support.
(1 = enable, 0 = disable, -1 = auto (default))
.It Va drm.radeon.aspm
XXX
.El
.Sh SYSCTL VARIABLES
If display backlight level can be controlled by the GPU (which is mostly
the case in notebooks), the sysctl
.Va hw.backlight_level
can be used to adjust the backlight level.
Permitted values are from 0 to the value returned by the
.Va hw.backlight_max
sysctl.
.Sh SEE ALSO
.Xr drm 4 ,
.Xr syscons 4
.Sh HISTORY
RADEONKMS was first available for Linux.
.Sh BUGS
Currently MSI interrupts cannot be used by
.Nm
because MSI support is still missing from the vgapci driver.
XXX find more
